{"0": "In this work, we propose a new utilisation of the machine, integrating it at the core of a human creative process. Minimizing this energy naturally leads to a detail preserving cubic geometry. It is a pictorial game consisting of interactive rounds of creation between artists and a machine. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. With the on-going technological revolution, the human-machine interaction is deeply evolving. ", "1": "The use of extreme point distance criterion to determine feature points. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. We propose a new form of human-machine interaction. Alongside fostering creativity, the process is designed to question the growing interaction between humans and machines. the main contributions of this paper are as follows. ", "2": "Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. based on position and normal guidance Given a point cloud our algorithm is able to recognize multiscale ridge-valley features by judging the distance from the current point to the curvature extreme point. At the same time, it can effectively enhance features by the position and normal constraints. ", "3": "In addition, subsequent processing, such as resampling and smooth filtering, may further damage these features. For instance were able to generate aesthetic full-stack painting. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. This is because investigating geometric styles is more challenging due to arbitrary topologies, curved metrics, and non-uniform discretization. ", "4": "With the on-going technological revolution, the human-machine interaction is deeply evolving. We propose a new form of human-machine interaction. ", "5": "With the on-going technological revolution, the human-machine interaction is deeply evolving. In this work, we propose a new utilisation of the machine, integrating it at the core of a human creative process. It is a pictorial game consisting of interactive rounds of creation between artists and a machine. ", "6": "As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. Our method serves as a non-realistic modeling tool where one can incorporate many artistic controls to create stylized geometries. From an outside perspective, the machine distorts their original painting style, both on the short term artworks resulting from their interaction (see Figure 2), and on their long term body of work as it inspired them on their machine-free paintings. based on position and normal guidance Given a point cloud our algorithm is able to recognize multiscale ridge-valley features by judging the distance from the current point to the curvature extreme point. based on position and normal guidance Given a point cloud our algorithm is able to recognize multiscale ridge-valley features by judging the distance from the current point to the curvature extreme point. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. ", "7": "We propose a new form of human-machine interaction. In the following, we approach this generic idea under a specific interactive framework. Ridge-valley features are important elements in point clouds that can intuitively sketch the basic shape of objects. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. ", "8": "Hence art creation could benefit of new tools while simultaneously supporting thoughts of how these interactions are affecting humans. For instance were able to generate aesthetic full-stack painting. Recently, GANs put a spotlight on the creative power of neural networks. We propose a new form of human-machine interaction. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. ", "9": "The idea is to suggest to humans, while painting, ramifications and directions of their on-going artwork. In this work, we propose a new utilisation of the machine, integrating it at the core of a human creative process. These features have important applications in fields including surface reconstruction , surface editing, visual perception and multi-perspective data registering. Our method serves as a non-realistic modeling tool where one can incorporate many artistic controls to create stylized geometries. We propose a new form of human-machine interaction. "}