{"0": "In this work, we propose a new utilisation of the machine, integrating it at the core of a human creative process. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. Alongside fostering creativity, the process is designed to question the growing interaction between humans and machines. With the on-going technological revolution, the human-machine interaction is deeply evolving. The use of extreme point distance criterion to determine feature points. ", "1": "We propose a new form of human-machine interaction. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. In general, point clouds are obtained by digitizing real objects with vision measuring equipment. We present a 3D stylization algorithm that can turn an input shape into the style of a cube while maintaining the content of the original shape. It is a pictorial game consisting of interactive rounds of creation between artists and a machine. ", "2": "Our method serves as a non-realistic modeling tool where one can incorporate many artistic controls to create stylized geometries. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. At the same time, it can effectively enhance features by the position and normal constraints. ", "3": "The idea is to suggest to humans, while painting, ramifications and directions of their on-going artwork. We propose a new form of human-machine interaction. It is a pictorial game consisting of interactive rounds of creation between artists and a machine. The use of extreme point distance criterion to determine feature points. ", "4": "Different forms of the constraint can produce different enhancement effects, such as maintaining the original features as much as possible or creating sharper features. We propose a new form of human-machine interaction. ", "5": "It is a pictorial game consisting of interactive rounds of creation between artists and a machine. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. The idea is to suggest to humans, while painting, ramifications and directions of their on-going artwork. ", "6": "The use of extreme point distance criterion to determine feature points. In stark contrast, direct stylization of 3D shapes or non-realistic modeling has received far less attention. From an outside perspective, the machine distorts their original painting style, both on the short term artworks resulting from their interaction (see Figure 2), and on their long term body of work as it inspired them on their machine-free paintings. based on position and normal guidance Given a point cloud our algorithm is able to recognize multiscale ridge-valley features by judging the distance from the current point to the curvature extreme point. The idea is to suggest to humans, while painting, ramifications and directions of their on-going artwork. They repetitively paint one after the other. ", "7": "For instance were able to generate aesthetic full-stack painting. With the on-going technological revolution, the human-machine interaction is deeply evolving. Ridge-valley features are important elements in point clouds that can intuitively sketch the basic shape of objects. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. ", "8": "Our method serves as a non-realistic modeling tool where one can incorporate many artistic controls to create stylized geometries. The use of extreme point distance criterion to determine feature points. At the same time, it can effectively enhance features by the position and normal constraints. As such, the interaction is not innocuous, even though, contrarily to our daily experience, we have made the machine impact as explicit as possible with its recognizable blue contributions. The effective recognition and enhancement of ridge-valley features are important topics in point cloud processing. ", "9": "We propose a new form of human-machine interaction. For instance were able to generate aesthetic full-stack painting. In the following, we approach this generic idea under a specific interactive framework. Different forms of the constraint can produce different enhancement effects, such as maintaining the original features as much as possible or creating sharper features. Our installation where the machine projects completions without painting, combined with generative network capability, allows to explore that in a principled way. "}